{  
    "class_name":"Sequential",
    "config":{  
       "name":"sequential_1",
       "layers":[  
          {  
             "class_name":"Dense",
             "config":{  
                "name":"dense_1",
                "trainable":true,
                "batch_input_shape":[  
                   null,
                   8
                ],
                "dtype":"float32",
                "units":12,
                "activation":"relu",
                "use_bias":true,
                "kernel_initializer":{  
                   "class_name":"VarianceScaling",
                   "config":{  
                      "scale":1.0,
                      "mode":"fan_avg",
                      "distribution":"uniform",
                      "seed":null
                   }
                },
                "bias_initializer":{  
                   "class_name":"Zeros",
                   "config":{  
 
                   }
                },
                "kernel_regularizer":null,
                "bias_regularizer":null,
                "activity_regularizer":null,
                "kernel_constraint":null,
                "bias_constraint":null
             }
          },
          {  
             "class_name":"Dense",
             "config":{  
                "name":"dense_2",
                "trainable":true,
                "dtype":"float32",
                "units":8,
                "activation":"relu",
                "use_bias":true,
                "kernel_initializer":{  
                   "class_name":"VarianceScaling",
                   "config":{  
                      "scale":1.0,
                      "mode":"fan_avg",
                      "distribution":"uniform",
                      "seed":null
                   }
                },
                "bias_initializer":{  
                   "class_name":"Zeros",
                   "config":{  
 
                   }
                },
                "kernel_regularizer":null,
                "bias_regularizer":null,
                "activity_regularizer":null,
                "kernel_constraint":null,
                "bias_constraint":null
             }
          },
          {  
             "class_name":"Dense",
             "config":{  
                "name":"dense_3",
                "trainable":true,
                "dtype":"float32",
                "units":1,
                "activation":"sigmoid",
                "use_bias":true,
                "kernel_initializer":{  
                   "class_name":"VarianceScaling",
                   "config":{  
                      "scale":1.0,
                      "mode":"fan_avg",
                      "distribution":"uniform",
                      "seed":null
                   }
                },
                "bias_initializer":{  
                   "class_name":"Zeros",
                   "config":{  
 
                   }
                },
                "kernel_regularizer":null,
                "bias_regularizer":null,
                "activity_regularizer":null,
                "kernel_constraint":null,
                "bias_constraint":null
             }
          }
       ]
    },
    "keras_version":"2.2.5",
    "backend":"tensorflow"
 }
 1
 2
 3
 4
 5
 6
 7
 8
 9
 10
 11
 12
 13
 14
 15
 16
 17
 18
 19
 20
 21
 22
 23
 24
 25
 26
 27
 28
 29
 30
 31
 32
 33
 34
 35
 36
 37
 38
 39
 40
 41
 42
 43
 44
 45
 46
 47
 48
 49
 50
 51
 52
 53
 54
 55
 56
 57
 58
 59
 60
 61
 62
 63
 64
 65
 66
 67
 68
 69
 70
 71
 72
 73
 74
 75
 76
 77
 78
 79
 80
 81
 82
 83
 84
 85
 86
 87
 88
 89
 90
 91
 92
 93
 94
 95
 96
 97
 98
 99
 100
 101
 102
 103
 104
 105
 106
 107
 {  
    "class_name":"Sequential",
    "config":{  
       "name":"sequential_1",
       "layers":[  
          {  
             "class_name":"Dense",
             "config":{  
                "name":"dense_1",
                "trainable":true,
                "batch_input_shape":[  
                   null,
                   8
                ],
                "dtype":"float32",
                "units":12,
                "activation":"relu",
                "use_bias":true,
                "kernel_initializer":{  
                   "class_name":"VarianceScaling",
                   "config":{  
                      "scale":1.0,
                      "mode":"fan_avg",
                      "distribution":"uniform",
                      "seed":null
                   }
                },
                "bias_initializer":{  
                   "class_name":"Zeros",
                   "config":{  
  
                   }
                },
                "kernel_regularizer":null,
                "bias_regularizer":null,
                "activity_regularizer":null,
                "kernel_constraint":null,
                "bias_constraint":null
             }
          },
          {  
             "class_name":"Dense",
             "config":{  
                "name":"dense_2",
                "trainable":true,
                "dtype":"float32",
                "units":8,
                "activation":"relu",
                "use_bias":true,
                "kernel_initializer":{  
                   "class_name":"VarianceScaling",
                   "config":{  
                      "scale":1.0,
                      "mode":"fan_avg",
                      "distribution":"uniform",
                      "seed":null
                   }
                },
                "bias_initializer":{  
                   "class_name":"Zeros",
                   "config":{  
  
                   }
                },
                "kernel_regularizer":null,
                "bias_regularizer":null,
                "activity_regularizer":null,
                "kernel_constraint":null,
                "bias_constraint":null
             }
          },
          {  
             "class_name":"Dense",
             "config":{  
                "name":"dense_3",
                "trainable":true,
                "dtype":"float32",
                "units":1,
                "activation":"sigmoid",
                "use_bias":true,
                "kernel_initializer":{  
                   "class_name":"VarianceScaling",
                   "config":{  
                      "scale":1.0,
                      "mode":"fan_avg",
                      "distribution":"uniform",
                      "seed":null
                   }
                },
                "bias_initializer":{  
                   "class_name":"Zeros",
                   "config":{  
  
                   }
                },
                "kernel_regularizer":null,
                "bias_regularizer":null,
                "activity_regularizer":null,
                "kernel_constraint":null,
                "bias_constraint":null
             }
          }
       ]
    },
    "keras_version":"2.2.5",
    "backend":"tensorflow"
 }